api/app/controllers/epics_controller.rb

SELECT "epics".* FROM "epics"
---
  def index
    @epics = Epic.all

INSERT INTO "epics" ("title", "name", "summary", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Hi"], ["name", "hello"], ["summary", "Hello"], ["img_url", "Hi"], ["created_at", 2016-08-22 14:44:02 UTC], ["updated_at", 2016-08-22 14:44:02 UTC]]
---
  def create
    @epic = Epic.new(epic_params)

    if @epic.save

UPDATE "epics" SET "name" = $1, "summary" = $2, "updated_at" = $3 WHERE "epics"."id" = $4  [["name", "Jorp Jorpsonnnnn"], ["summary", "I bless the wevrainnssss down in Affricaaaa"], ["updated_at", 2016-08-24 18:59:03 UTC], ["id", 2]]
---
  def update
    if @epic.update(epic_params)

DELETE FROM "epics" WHERE "epics"."id" = $1  [["id", 3]]
---
  def destroy
    @epic.destroy

SELECT  "epics".* FROM "epics" WHERE "epics"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_epic
      @epic = Epic.find(params[:id])