api/app/controllers/stories_controller.rb

  def update
    if @story.update(story_params)
---
UPDATE "stories" SET "title" = $1, "summary" = $2, "updated_at" = $3 WHERE "stories"."id" = $4  [["title", "Wentttt to awesome castle"], ["summary", "It was so awesome!!!"], ["updated_at", 2016-08-24 18:53:09 UTC], ["id", 1]]